def tasks():
    print("== Главное меню ==")
    print("1. Численное интегрирование")
    print("2. Дифференциальное уравнение")
    print("3. Элементарная функция")
    print("4. Нелинейное уравнение")
    print("0. Завершить работу")
    print("\n")

def integrationTypes():
    print("== Варианты интеграции ==")
    print("1. Постоянный шаг")
    print("2. Переменный шаг")
    print("3. Кратный интеграл")
    print("0. Назад")
    print("\n")


def ConstStepMethods():
    print("== Алгоритмы с постоянным шагом ==")
    print("1. Метод прямоугольников левых частей")
    print("2. Метод прямоугольников правых частей")
    print("3. Метод трапеций")
    print("4. Метод симпсона")
    print("0. Назад")
    print("\n")


def VarStepMethods():
    print("== Алгоритмы с переменным шагом ==")
    print("1. Алгоритм 1")
    print("2. Алгоритм 2")
    print("0. Назад")
    print("\n")

def diff_ur():
    print("=== Дифференциальные уравнения ===")
    print("1. Метод Эйлера")
    print("2. Метод Рунге-Кутты")
    print("3. Метод Адамса")
    print("0. Назад")

def elementary_func():
    print("=== Элементарные функции ===")
    print("1. Вычисление значений функций")
    print("2. Построение графиков")
    print("3. Табулирование функций")
    print("0. Назад")

def nonlinear():
    print("=== Нелинейные уравнения ===")
    print("1. Метод половинного деления")
    print("2. Метод Ньютона")
    print("3. Метод секущих")
    print("0. Назад")
